app/controllers/login_screen_controller.rb

SELECT "users".* FROM "users" WHERE "users"."name" = 'Alikhan' LIMIT 1
---
  def create
    user = User.find_by(name: params[:name])