app/controllers/message_controller.rb

SELECT "messages".* FROM "messages" ORDER BY "messages"."start_time" ASC
---
 def index
    @messages = Message.order(start_time: :asc)

INSERT INTO "messages" ("time_spend_type", "activity", "start_time", "end_time", "created_at", "updated_at") VALUES ('Блять', 'я ебал', '2202-02-02 15:15:00', '2202-02-02 15:45:00', '2025-06-01 04:27:11.167350', '2025-06-01 04:27:11.167350') RETURNING "id"
---
  def create
  @message = Message.new(message_params)   # <--- Инициализация объекта здесь!
  @messages = Message.order(start_time: :asc)

  if @message.save

DELETE FROM "messages" WHERE "messages"."id" = 1
---
  def destroy
    @message.destroy

SELECT "messages".* FROM "messages" WHERE "messages"."id" = 1 LIMIT 1
---
  def set_message
    @message = Message.find(params[:id])  # Ищи конкретное сообщение по id

SELECT "settings".* FROM "settings" ORDER BY "settings"."id" ASC LIMIT 1
---
  def load_user_settings
    @setting = Setting.first_or_create