app/controllers/settings_controller.rb

  def set_setting
    @setting = Setting.first_or_create
---
SELECT "settings".* FROM "settings" ORDER BY "settings"."id" ASC LIMIT 1