app/controllers/stat_controller.rb

  def index
    messages = Message.all

    # Группировка по типу времени
    @time_spendings = messages.group_by(&:time_spend_type).transform_values do |group|
---
SELECT "messages".* FROM "messages"